student_id = ""
f_name = ""  # Имя
l_name = ""  # Фамилия
m_name = ""  # Отчество
hw_list = list()
pa_list = list()
list_visit = list()



# TODO: Запрашиваем id студента
# TODO: 
#  Запрашиваем ФИО студента
#  Проверить, чтобы ФИО не содержало цифры и пробелы.
#  Если ФИО не корректно, то оповещаем и заново запросить (отдельно для каждой переменной).
#  ФИО должно начинаться с большой буквы - title применить


# TODO: Создать меню - while True
# TODO: Пункты меню
# TODO: 1. Show student data
#    Student ID: <student_id>
#    Full name: <l_name> <f_name> <m_name>
#
#    Homeworks: 
#    <position>. <grade_or_minus>
#
#    Practical tasks: 
#    <position>. <grade_or_minus>
#
#    Visit:
#    <position>. <present_or_absent>

# TODO: 2. Show student stats
# ДЗ и ПЗ, у которых "-", не участвуют в вычислении средней.
# Нужно будет подсчитывать количество оценок, которые не равны "-". Потом использовать его в нахождении средней оценки.
# ФИО;
# общая средняя оценка по всем выполненным ДЗ и ПЗ;
# средняя оценка за ПЗ;
# количество выполненных ПЗ и общее количество ПЗ;
# процент выполненных ПЗ; количество выполненных поделить на общее, умножить на 100.
# средняя оценка за ДЗ;
# количество выполненных ДЗ и общее количество ДЗ;
# процент выполненных ДЗ;
# количество посещённых занятий и общее количество занятий;
# процент посещений.

# TODO: 3. Change full name
# Запросить что конкретно пользователь хочет изменить: 1. 2. 3.
# 1. фамилию - проверяем точно также, как наверху. Если проверки прошли, то меняем данные.
# 2. имя - проверяем точно также, как наверху. Если проверки прошли, то меняем данные.
# 3. отчество - проверяем точно также, как наверху. Если проверки прошли, то меняем данные.

# TODO: 4. Add HW
# Условимся, что "-" означает задание, которое не оценено.
# hw_list.append("-")

# TODO: 5. Grade HW
# Запросить номер задания, который лежит в hw_list
# Проверить номер задания на границы (допустимые от 1 до len(hw_list) включительно)
# Если номер в порядке, запросить оценку
# Проверить оценку на границы (допустимые целые от 1 до 12 включительно)
# Если границы в порядке, то изменяем на новую оценку по индексу (позиция - 1)

# TODO: 6. Delete HW Grade
# Запросить номер задания, который лежит в hw_list
# Проверить номер задания на границы (допустимые от 1 до len(hw_list) включительно)
# Если номер в порядке, удаляем по индексу (позиция - 1)

# TODO: Для PA всё аналогично HW  7, 8, 9

# TODO: 10. Add visit
# Показать подменю с пунктами 1 и 2, где 1 - present, 2 - absent.
# Запрашиваем выбор пункта.
# В любом верном пункте добавляем в list_visit present или absent.

# TODO: 11. Change visit
# Запрашиваем номер посещения, который лежит в list_visit.
# Проверяем номер на границы (допустимые от 1 до len(list_visit) включительно)
# Если номер посещения в порядке, то показать подменю с пунктами 1 и 2, где 1 - present, 2 - absent.
# Запрашиваем выбор пункта.
# В любом верном пункте по указанному индексу (позиция - 1) заменяем на present или absent.

# TODO: 12. Delete visit
# Запрашиваем номер посещения, который хотим удалить.
# Проверяем номер на границы (допустимые от 1 до len(list_visit) включительно)
# del list_visit[index]