student_id = ""
f_name = ""  # Имя
l_name = ""  # Фамилия
m_name = ""  # Отчество
hw_list = list()
pa_list = list()
list_visit = list()



# TODO: Запрашиваем id студента
# TODO: 
#  Запрашиваем ФИО студента
#  Проверить, чтобы ФИО не содержало цифры и пробелы.
#  Если ФИО не корректно, то оповещаем и заново запросить (отдельно для каждой переменной).
#  ФИО должно начинаться с большой буквы - title применить


# TODO: Создать меню - while True
# TODO: Пункты меню
# TODO: 1. Show student data
#    Student ID: <student_id>
#    Full name: <l_name> <f_name> <m_name>
#
#    Homeworks: 
#    <position>. <grade_or_minus>
#
#    Practical tasks: 
#    <position>. <grade_or_minus>
#
#    Visit:
#    <position>. <present_or_absent>

# TODO: 2. Show student stats
# ФИО;
# общая средняя оценка по всем выполненным ДЗ и ПЗ;
# средняя оценка за ПЗ;
# количество выполненных ПЗ и общее количество ПЗ;
# процент выполненных ПЗ;
# средняя оценка за ДЗ;
# количество выполненных ДЗ и общее количество ДЗ;
# процент выполненных ДЗ;
# количество посещённых занятий и общее количество занятий;
# процент посещений.

